{
    "name": "Delta Quadrant",
    "size": {
        "width": 2,
        "height": 2
    },
    "mapDescription": "",
    "playerData": {
        "startingX": 1,
        "startingY": 1
    },
    "items": [
        {
            "itemType": "None",
            "name": "None",
            "description": "",
            "weight": 0,
            "value": 0,
            "cost": 0,
            "multiplier": 0
        },
        {
            "itemType": "Money",
            "name": "Federation Credits",
            "description": "Federation Credits are a form of currency used throughout the United Federation of Planets. They are often used to purchase goods and services in markets and shops, and can be traded or exchanged for other forms of currency. Federation Credits are issued by the Federation Government and are widely accepted throughout the galaxy as a reliable and secure form of payment.",
            "weight": 0,
            "value": 1,
            "cost": 0,
            "multiplier": 0
        },
        {
            "itemType": "Health",
            "name": "Hypospray",
            "description": "A device used by Starfleet medical personnel to administer medication or other substances to a patient. It can be programmed to deliver a specific dosage and can be used to treat a variety of ailments.",
            "weight": 0.5,
            "value": 5,
            "cost": 50,
            "multiplier": 1.5
        },
        {
            "itemType": "Weapon",
            "name": "Phaser",
            "description": "A handheld energy weapon used by Starfleet personnel. It can be set to stun or kill and has multiple settings for different levels of firepower.",
            "weight": 1,
            "value": 10,
            "cost": 100,
            "multiplier": 2
        },
        {
            "itemType": "Armour",
            "name": "Tactical Vest",
            "description": "A lightweight vest worn by Starfleet security personnel to provide additional protection in combat situations. It is made of durable materials and has pockets for carrying various equipment.",
            "weight": 2,
            "value": 15,
            "cost": 150,
            "multiplier": 1.5
        },
        {
            "itemType": "Miscellaneous",
            "name": "Tricorder",
            "description": "A handheld device used by Starfleet personnel to scan and analyze their surroundings. It can detect various types of energy and matter and has a wide range of other functions, including communication and navigation.",
            "weight": 0.75,
            "value": 5,
            "cost": 75,
            "multiplier": 1
        }
    ],
    "enemies": [
        {
            "enemyType": "None",
            "name": "None",
            "description": "None",
            "health": 0,
            "loot_chance": 0,
            "loot_type": "",
            "damage_resistance_multiplier": 0.1,
            "attack_multiplier": 0.1
        },
        {
            "enemyType": "Borg",
            "name": "Borg Drone",
            "description": "The Borg are a race of cybernetic beings, combining organic and technological elements. They are known for their relentless pursuit of perfection through assimilation, and their ability to adapt to almost any threat. The Borg Drone is a standard unit of the Borg Collective, with a partially cybernetic body and a single-minded focus on completing its assigned tasks. It is a formidable opponent in combat, with enhanced strength and durability, and the ability to adapt to counter almost any attack.",
            "health": 20,
            "loot_chance": 0.2,
            "loot_type": "Money",
            "damage_resistance_multiplier": 1.5,
            "attack_multiplier": 1.3
        },
        {
            "enemyType": "Kazon",
            "name": "Kazon Warrior",
            "description": "The Kazon are a race of primitive and aggressive humanoids, known for their martial prowess and fierce territoriality. The Kazon Warrior is a formidable opponent in close combat, wielding a variety of primitive weapons and exhibiting a high tolerance for pain. They are often found in the lawless regions of space, where they engage in piracy and territorial battles with other factions.",
            "health": 15,
            "loot_chance": 0.1,
            "loot_type": "Money",
            "damage_resistance_multiplier": 1.2,
            "attack_multiplier": 1.1
        },
        {
            "enemyType": "8472",
            "name": "Species 8472 Bio-Ship",
            "description": "Species 8472 is a race of highly advanced and technologically advanced beings, hailing from a parallel dimension. They are known for their hostility towards other races and their highly advanced biological ships. The Species 8472 Bio-Ship is a formidable opponent, with advanced weapons and shielding systems, as well as the ability to adapt to almost any threat. It is a formidable opponent in combat, and should be approached with caution.",
            "health": 25,
            "loot_chance": 0.3,
            "loot_type": "Money",
            "damage_resistance_multiplier": 2,
            "attack_multiplier": 1.5
        }
    ],
    "mapSquares": [
        {
        "coordinates": [
        0,
        0
        ],
        "description": "The Borg Cube: A massive, cube-shaped starship, home to the cybernetic race known as the Borg. The Borg are a formidable enemy, known for their ability to assimilate other species into their collective and adapt to any threat. The Cube is heavily fortified and well-defended, making it a challenging target for any would-be attackers.",
        "chanceOfEnemies": 0.5,
        "enemyType": "Borg",
        "chanceOfLoot": 0.1,
        "lootType": "Money"
        },
        {
        "coordinates": [
        0,
        1
        ],
        "description": "Kazon-Ogla Territory: The Kazon-Ogla are a violent and aggressive species, known for their territorial disputes and raids on other civilizations. Their territory is marked by the presence of numerous warships and armed outposts, making it a dangerous place to venture",
        "chanceOfEnemies": 0.7,
        "enemyType": "Kazon",
        "chanceOfLoot": 0.2,
        "lootType": "Health"
        },
        {
        "coordinates": [
        1,
        0
        ],
        "description": "Fluidic Space: A chaotic and dangerous realm, filled with swirling energies and deadly creatures. Fluidic Space is the realm inhabited by the powerful and enigmatic species known as Species 8472. It is a vast and interconnected network of gas and fluid-filled dimensions, filled with strange and dangerous life forms. It is a place of great danger, and only the bravest of explorers dare venture into its depths.",
        "chanceOfEnemies": 0.9,
        "enemyType": "8472",
        "chanceOfLoot": 0.3,
        "lootType": "Armour"
        },
        {
        "coordinates": [
        1,
        1
        ],
        "description": "The Quiet Nebula is a peaceful and serene area, with gentle clouds of gas and dust drifting lazily through the void. To the South lies the treacherous Kazon-Ogla territory, where the aggressive Kazon clans roam and fight amongst themselves. To the south-west an abandoned Borg Cube. To the west is is the mysterious realm of Fluidic Space, home to the enigmatic 8472 species and their strange, otherworldly biology. Despite its peaceful atmosphere, the Quiet Nebula is not without danger, as powerful forces are always at play in the depths of space.",
        "chanceOfEnemies": 0.0,
        "enemyType": "None",
        "chanceOfLoot": 0.0,
        "lootType": "None"
        }
        ]
}