{
    "name": "Delta Quadrant",
    "size": {
        "width": 3,
        "height": 3
    },
    "mapDescription": "The Delta Quadrant is a vast and largely unexplored region of space, filled with dangers and mysteries. As you chart a course through this uncharted territory, you'll encounter abandoned Borg cubes, hostile Kazon planets, and swirling nebulae filled with unknown life forms. You'll also encounter friendly ships and locations, such as federation shuttles and shipyards, where you can find valuable loot and supplies. But be on guard at all times, as danger lurks around every corner in this treacherous region of space.",
    "playerData": {
        "startingX": 2,
        "startingY": 2,
        "startingHealth": 10,
        "startingArmour": 10,
        "startingWeapon": "Hand Phaser"
    },
    "items": [
        {
            "itemType": "None",
            "name": "None",
            "description": "",
            "weight": 0,
            "value": 0,
            "cost": 0,
            "multiplier": 0,
            "healthRecovery": 0,
            "equippable": false,
            "equipped": false,
            "colour": "yellow"
        },
        {
            "itemType": "treasure",
            "name": "Gold-Pressed Latinum",
            "description": "A highly valuable currency used by many species throughout the Alpha Quadrant, particularly the Ferengi Alliance. Latinum is typically stored in small, shiny bars or slips, and is prized for its rarity and inherent value.",
            "weight": 1,
            "value": 1000,
            "cost": 1000,
            "multiplier": 0,
            "equippable": false,
            "equipped": false,
            "colour": "yellow",
            "healthRecovery": 0
        },
        {
            "itemType": "money",
            "name": "Federation Credit",
            "weight": 0.01,
            "value": 1,
            "cost": 1,
            "multiplier": 0,
            "description": "Standard currency used by the United Federation of Planets",
            "equippable": false,
            "equipped": false,
            "colour": "yellow",
            "healthRecovery": 0
        },
        {
            "itemType": "money",
            "name": "Klingon Talon",
            "weight": 0.01,
            "value": 10,
            "cost": 10,
            "multiplier": 0,
            "description": "Standard currency used by the Klingon Empire",
            "equippable": false,
            "equipped": false,
            "colour": "yellow",
            "healthRecovery": 0
        },
        {
            "itemType": "health",
            "name": "Hypospray",
            "healthRecovery": 10,
            "description": "A hypospray used to administer medical treatments and medications",
            "equippable": false,
            "equipped": false,
            "colour": "green",
            "weight": 0.1,
            "value": 5,
            "cost": 10,
            "multiplier": 0
        },
        {
            "itemType": "armour",
            "name": "Tactical Vest",
            "description": "A lightweight vest made of advanced materials that provides protection against bullets and other forms of damage.",
            "weight": 1,
            "value": 25,
            "cost": 50,
            "multiplier": 0,
            "equippable": true,
            "equipped": false,
            "colour": "bright blue",
            "healthRecovery": 15
        },
        {
            "itemType": "weapon",
            "name": "Hand Phaser",
            "weight": 0.5,
            "value": 10,
            "cost": 100,
            "multiplier": 0,
            "description": "A handheld energy weapon used by Starfleet",
            "equippable": true,
            "equipped": false,
            "colour": "yellow",
            "healthRecovery": 0,
            "damageRangeMin": 0.1,
            "damageRangeMax": 1,
            "damageModifier": 1
        },
        {
            "itemType": "weapon",
            "name": "Phaser Rifle",
            "weight": 3,
            "value": 100,
            "cost": 1000,
            "multiplier": 0,
            "description": "A powerful handheld energy weapon used by Starfleet",
            "equippable": true,
            "equipped": false,
            "colour": "yellow",
            "healthRecovery": 0,
            "damageRangeMin": 3,
            "damageRangeMax": 5,
            "damageModifier": 1
        },
        {
            "itemType": "key",
            "name": "Access Card",
            "weight": 0.0,
            "value": 0,
            "cost": 0,
            "multiplier": 0,
            "description": "An access card used to open doors and access restricted areas on the ship",
            "equippable": false,
            "equipped": false,
            "colour": "yellow",
            "healthRecovery": 0
        }
    ],
    "storeItems": [
        {
            "shopID": 1,
            "shopCost": 1,
            "shopItems": {
                "Tactical Vest": 10,
                "Hypospray": 10
            },
            "shopWallet":{
                "Federation Credit": 1000,
                "Klingon Talon": 1000
            }
        },
        {
            "shopID": 2,
            "shopCost": 0.1,
            "shopItems": {
                "Tactical Vest": 100,
                "Hypospray": 100
            },
            "shopWallet":{
                "Federation Credit": 10000,
                "Klingon Talon": 10000
            }
        }
    ],
    "enemies": [
        {
            "enemyType": "None",
            "name": "None",
            "description": "None",
            "health": 0,
            "loot_chance": 0,
            "loot_type": "",
            "loot": "None",
            "lootAmount": 0,
            "damage_resistance_multiplier": 0.1,
            "attack_multiplier": 0.1
        },
        {
            "enemyType": "Borg",
            "name": "Borg Drone",
            "description": "A member of the Borg Collective, a race of cybernetic beings who seek to assimilate other species into their collective. The Borg Drone is a formidable opponent, with advanced technology and weapons at its disposal. Its organic and artificial parts are seamlessly integrated, making it immune to many forms of attack. The Borg's primary goal is to assimilate other species and technologies into the Collective, and they will stop at nothing to achieve this goal.",
            "health": 50,
            "loot_chance": 0.3,
            "loot": "Federation Credit",
            "lootAmount": 100,
            "damage_resistance_multiplier": 1.5,
            "attack_multiplier": 1.5
        },
        {
            "enemyType": "Kazon",
            "name": "Kazon Raider",
            "description": "The Kazon are a warlike, faction-based species native to the Delta Quadrant. They are known for their aggressive expansionist policies, frequently attacking and pillaging other civilizations for resources. The Kazon are a formidable opponent in combat. The Kazon are known to be ruthless and cunning in their tactics.",
            "health": 10,
            "loot_chance": 0.9,
            "loot": "Federation Credit",
            "lootAmount": 10,
            "damage_resistance_multiplier": 1.5,
            "attack_multiplier": 1.2
        },
        {
            "enemyType": "8472",
            "name": "species 8472",
            "description": "Species 8472 is a highly advanced, extra-dimensional alien species that poses a significant threat to the safety of the galaxy. They are known for their powerful biotechnology, which allows them to adapt to any environment and effectively counter any attack. The Borg have attempted to assimilate them on multiple occasions, but have always been unsuccessful due to their advanced resistance to assimilation. They are highly aggressive and will stop at nothing to protect their own interests.",
            "health": 100,
            "loot_chance": 1,
            "lootAmount": 2,
            "loot": "Gold-Pressed Latinum",
            "damage_resistance_multiplier": 1.5,
            "attack_multiplier": 2.0
        }
    ],
    "mapSquares": [
        {
            "coordinates": [
                0,
                0
            ],
            "description": "An abandoned Borg cube, its once sleek and intimidating exterior now showing signs of wear and damage. The familiar hum of the Borg's technology can still be heard, but it is faint and intermittent. As you cautiously enter the cube, you are met with the eerie silence of a once bustling ship. The corridors and chambers are empty, but remnants of the Borg's technology can still be found scattered throughout the ship. It's unclear what caused the Borg's abandonment of this vessel, but it is clear that it is now a shell of its former self.",
            "chanceOfEnemies": 0.5,
            "chanceOfLoot": 0.1,
            "enemyType": "Borg",
            "lootName": "Federation Credit",
            "lootAmount": 10,
            "lootType": "money",
            "requiredKey": "default",
            "shopID": 0
        },
        {
            "coordinates": [
                0,
                1
            ],
            "description": "Open space",
            "chanceOfEnemies": 0,
            "chanceOfLoot": 0.5,
            "enemyType": "None",
            "lootName": "None",
            "lootAmount": 0,
            "lootType": "health",
            "requiredKey": "default",
            "shopID": 2
        },
        {
            "coordinates": [
                0,
                2
            ],
            "description": "A swirling nebula fills the area, making it difficult to see. The glowing gases create an ethereal atmosphere, but danger lurks within as there is a low chance of encountering a species 8472.",
            "chanceOfEnemies": 0.1,
            "chanceOfLoot": 0.1,
            "enemyType": "8472",
            "lootName": "Gold-Pressed Latinum",
            "lootAmount": 1,
            "lootType": "money",
            "requiredKey": "default",
            "shopID": 0
        },
        {
            "coordinates": [
                1,
                0
            ],
            "description": "A Kazon planet, known for their aggression and hostility towards other species",
            "chanceOfEnemies": 0.9,
            "chanceOfLoot": 0.5,
            "enemyType": "Kazon",
            "lootName": "Hypospray",
            "lootAmount": 1,
            "lootType": "health",
            "requiredKey": "default",
            "shopID": 0
        },
        {
            "coordinates": [
                1,
                1
            ],
            "description": "An apparently abandoned Kazon ship floating in space. You can see the damage from blaster fire on the exterior of the ship. As you approach, you can hear the faint hum of the ship's systems still active. You carefully make your way inside, your weapon at the ready. The corridors are empty, but you can feel the presence of the Kazon who were once on board. You search the ship and find the Access Card, a valuable item that will allow you to enter restricted areas.",
            "chanceOfEnemies": 1,
            "chanceOfLoot": 1,
            "enemyType": "Kazon",
            "lootName": "Access Card",
            "lootAmount": 1,
            "lootType": "key",
            "requiredKey": "default",
            "shopID": 0
        },
        {
            "coordinates": [
                1,
                2
            ],
            "description": "A mysterious nebula fills the sky, swirling with all the colors of the rainbow. The gases and particles are so dense that they obscure most of the stars and celestial bodies, making navigation in this region treacherous. Strange energy readings and anomalies have been reported in this area, leading some to believe that it may be home to unknown life forms or hidden technologies.",
            "chanceOfEnemies": 0.5,
            "chanceOfLoot": 0.1,
            "enemyType": "Borg",
            "lootName": "Federation Credit",
            "lootAmount": 1000,
            "lootType": "money",
            "requiredKey": "default",
            "shopID": 0
        },
        {
            "coordinates": [
                2,
                0
            ],
            "description": "An abandoned Federation shuttle sits on the surface of the planet. It looks like it has been there for some time, with the paint starting to fade and some parts showing signs of damage. You approach the shuttle and see that the door is slightly open, beckoning you to enter. As you step inside, you can see that the interior of the shuttle is in disarray, with equipment and supplies scattered across the floor. It looks like there was a struggle here at some point. You wonder what could have happened to the crew and what secrets the shuttle might hold.",
            "chanceOfEnemies": 0,
            "chanceOfLoot": 1,
            "enemyType": "None",
            "lootName": "Phaser Rifle",
            "lootAmount": 1,
            "lootType": "weapon",
            "requiredKey": "Access Card",
            "shopID": 0
        },
        {
            "coordinates": [
                2,
                1
            ],
            "description": "A rift into fluidic space. You approach a strange, shimmering rift in the fabric of space. As you get closer, you can feel the energy emanating from it, pulsing with an otherworldly power. You hesitate for a moment, wondering if it would be wise to venture any closer. But your curiosity gets the better of you, and you decide to take a closer look. As you scan the rift, you see swirling currents of energy, swirling and churning in an endless dance.",
            "chanceOfEnemies": 0.9,
            "chanceOfLoot": 0.5,
            "enemyType": "8472",
            "lootName": "Gold-Pressed Latinum",
            "lootAmount": 1,
            "lootType": "money",
            "requiredKey": "default",
            "shopID": 0
        },
        {
            "coordinates": [
                2,
                2
            ],
            "description": "The shipyard is bustling with activity as federation engineers and workers scurry about, repairing and constructing new ships. You see a variety of vessels in various stages of completion, from small shuttlecraft to massive starship hulls. Despite the hustle and bustle, the shipyard is eerily quiet, with only the sounds of welding and the occasional shouted instruction breaking the silence.",
            "chanceOfEnemies": 0,
            "chanceOfLoot": 0.9,
            "enemyType": "None",
            "lootName": "Hypospray",
            "lootAmount": 1,
            "lootType": "health",
            "requiredKey": "default",
            "shopID": 1
        }
    ]
}